
title: Infostealer High-Confidence Credential Access and Exfiltration
id: 50f27880-01d7-42b2-9368-0939504fa162
status: stable
description: >
  High-confidence detection of infostealer activity combining suspicious LOLBIN execution, browser credential store access, and network exfiltration. / Détection à haute confiance d’une activité infostealer combinant l’exécution suspecte de LOLBins, l’accès aux stockages d’identifiants des navigateurs et l’exfiltration réseau.

references:
  - https://www.dexpose.io/deep-dive-into-arkanix-stealer-and-its-infrastructure/
author: "Adama ASSIONGBON - SOC & CTI Analyst Consultant | https://www.linkedin.com/in/adama-assiongbon-9029893a/"
date: 2026-01-06
tags:
  - attack.execution
  - attack.t1059
  - attack.t1555
  - attack.exfiltration
  - attack.t1041
logsource:
  product: windows
  category: process_creation
detection:
  selection_exec:
    Image|endswith:
      - '\\powershell.exe'
      - '\\pwsh.exe'
      - '\\cmd.exe'
      - '\\mshta.exe'
      - '\\rundll32.exe'
    Image|contains:
      - '\\Users\\'
      - '\\AppData\\'
      - '\\Temp\\'
      - '\\Downloads\\'
  selection_creds:
    CommandLine|contains:
      - 'Login Data'
      - 'Cookies'
      - 'CryptUnprotectData'
  selection_net:
    CommandLine|contains:
      - 'http://'
      - 'https://'
      - 'Invoke-WebRequest'
      - 'curl'
      - 'wget'
  condition: selection_exec and selection_creds and selection_net
falsepositives:
  - Authorized forensic tools
level: critical
